
q = [
    {"названия":"кофе","цена": 120, "категория": "напиток"},
    {"названия":"чай","цена": 80, "категория": "напиток"},
    {"названия":"сок","цена": 150, "категория": "напиток"},
    {"названия":"пицца","цена": 500, "категория": "еда"},
    {"названия":"бургер","цена": 120, "категория": "еда"},
    {"названия":"торт","цена": 300, "категория": "десерт"},
    {"названия":"мороженое","цена": 200, "категория": "десерт"},
    {"названия":"плов","цена": 500, "категория": "основное"},

    
]

# 1 Ввывести те блюда которые дороже 150 
expensive_dishes = list(filter(lambda dish: dish["цена"] > 150, q))
print(expensive_dishes)
# Найти самое дорогое блюдо
most_expensive_dish = max(q, key=lambda dish: dish["цена"])
print(most_expensive_dish)
# отсортировать блюда по цене
sorted_dishes = sorted(q, key=lambda dish: dish["цена"])
print(sorted_dishes)
# Проверить есть ли хоть одно блюдо , где категория десерт
has_dessert = any(dish["категория"] == "десерт" for dish in q)
print(has_dessert)